import React from 'react'

import Typography from 'shared/Typography'

const PrivacyPolicy = () => {
  return (
    <Typography
      type="display3"
      column="true"
      height={300}
      margintop={2}
      padding={1}
      border="1px solid grey"
      style={{
        overflow: 'auto',
      }}
    >
      <strong>*개인정보의 수집목적 및 이용*</strong><br />
      <br/>개인정보를 수집하는 목적은 (주)한빛안경만의 정보와 맞춤회된 서비스를 제공하기 위하여 필요한 최소한의 정보만 수집하고 있습니다.
      <br/>
      <br/>(주)한빛안경에 등록하신 모든 회원과 방문객의 개인정보는 기본 수집 목적 이외에 다른 용도로 이용하거나 회원님의 동의 없이 제3자에게 제공할 수 없으며 회원정보와 관련한 회원이 피해를 입을 경우 이에 대한 모든 책임은 (주)한빛안경에서 집니다.
      <br/>
      <br/>개인정보수집 또는 이용에 대한 동의 철회시 (주)한빛안경는 개인정보를 수집하지 않으며 개인정보는 철회와 동시에 삭제됩니다.
      <br/>
      <br/>수집하는 개인정보 항목 및 수집방법
      <br/>(주)한빛안경는 이용자의 정보 수집시 서비스 제공에 필요한 최소한의 정보만을 수집하며 민감한 개인정보의 수집을 엄격히 제한하고 있습니다.
      <br/>
      <br/>* 필수사항 : 성명, 주민등록번호, 희망 ID, 비밀번호, E-mail
      <br/>* 선택사항 : 주소, 전화번호
      <br/>
      <br/>
      <br/>개인정보의 보유 및 이용기간
      <br/>(주)한빛안경는 방문객께서 (주)한빛안경가 제공하는 서비스를 받는 동안 개인정보를 계속 보유하며 맞춤화된 서비스 제공을 위해 이용하게 됩니다. 다만 방문객께서 탈퇴를 원하시거나 (주)한빛안경 약관에 의거 방문객자격 상실의 경우에는 등록된 방문객의 정보는 완전히 삭제되며 어떠한 용도로도 열람 또는 이용할 수 없도록 처리됩니다.
      <br/>
      <br/>개인정보의 공유 및 제공
      <br/>(주)한빛안경는 방문객의 개인정보를 법령에 근거한 경우를 제외하고 제3자에게 절대 제공하지 않습니다. 방문객의 편의를 제공하기 위하여 특정회사에 개인정보를 제공하고자 할 경우에는 반드시 방문객의 동의를 구하도록 되어 있습니다.
      <br/>단 (주)한빛안경 이용약관에 의거 다음 경우에 한하여 고객의 동의없이 최소한의 개인정보를 제공할 수 있습니다.
      <br/>1. 업무상 배송 또는 우편발송을 위해 필요한 최소한의 이용자정보를 제공할
      <br/>1. 수있습니다.
      <br/>2. 통계작성, 시장조사를 위하여 필요한 경우 특정 개인을 식별할 수 없는 형태
      <br/>1. 로 제공될 수 있습니다.
      <br/>
      <br/>쿠키(Cookie)의 운용 및 활용
      <br/>쿠키는 개개 의 웹사이트 이용자에 대해서 서비스를 제공하는 웹사이트에 대한 기본 설정 정보를 보관하기 위해, 웹 사이트가 이용자의 컴퓨터 브라우저(네스케이프, 인터넷 익스플로러 등)로 전송하는 소량의 정보입니다.
      <br/>이러한 쿠키의 사용은 로그인시 사용자가 등록된 방문객임을 인증하기 위한 수단으로만 사용할 뿐, 개인의 정보를 활용하여 정책에 도움을 주기 위한 방법으로 파일 쿠키를 사용하지는 않습니다.
      <br/>이와 더불어서 브라우저의 종료시나 로그 아웃시에 자동으로 만료되므로 공공장소나 타인이 사용할 수 있는 PC를 사용하실 경우에는 로그인 후 서비스 이용이 끝나시면 로그 아웃 해주시기 바랍니다.
      <br/>
      <br/>개인정보 열람 및 정정과 관련된 이용자 권리
      <br/>(주)한빛안경의 방문객은 (주)한빛안경에 등록되어 있는 방문객의 개인정보를 열람하거나 정정하실 수 있으며 수정된 정보는 완료된 시점부터 바로 적용이 되며 방문객 가입해지를 원하실 경우 해지신청 즉시 삭제됩니다.
      <br/>
      <br/>아동의 개인정보 수집
      <br/>(주)한빛안경는 아동의 방문객등록시 오프라인으로 아동의 법정대리인이 직접 방문객 가입을 하는 방법을 권하고 있으며 인터넷가입시 아동의 법정대리인과 방문객 가입신청 확인 후 방문객가입을 할 수 있도록 하고 있습니다.
      <br/>
      <br/>(주)한빛안경 회원개인정보 관리 책임자
      <br/>(주)한빛안경는 정보통신부 지정 "개인정보보호지침"에 의거 방문객 개인정보 관리책임자를 아래와 같이 지정합니다.
      <br/>*개인정보관리 책임자 :이재활
      <br/>* 주소 : 대구광역시 수성구 사월동 411-2
      <br/>* 문의전화 : 053-795-6251
      <br/>* E-MAIL :<a href='mailto:hwall3179@daum.net'>hwall3179@daum.net</a>
      <br/>
      <br/>개인정보 관리 책임자는 회원 여러분의 개인정보를 보호하고, 유출을 방지하는 책임자로서 회원들이 안심하고 이용할 수 있도록 도와 드립니다.
      <br/>
      <br/>저희 (주)한빛안경에서는 절대로 운영자를 사칭하여 아이디나 비밀번호를 묻거나 하지 않습니다. 쇼핑을 완료하신 후에는 종료를 해주시기 바랍니다.
      <br/>
      <br/>(주)한빛안경의 이용중 (주)한빛안경의 개인정보보호에 관련된 처리에 대하여 만족하지 못하실 경우에는 개인정보침해신고센터 (<a href="http://www.cyberprivacy.or.kr)">http://www.cyberprivacy.or.kr)</a>에서 그 처리를 의뢰할 수 있습니다.
      <br/>
    </Typography>
  )
}

export default PrivacyPolicy